# ZoneCalculatedHydronicHeatingflowParam Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ZoneCalculatedHydronicHeatingflowParam Property
ParameterTypeId Class See Also
---
"Calculated Hydronic Heating Flow"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ZoneCalculatedHydronicHeatingflowParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ZoneCalculatedHydronicHeatingflowParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ZoneCalculatedHydronicHeatingflowParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace